In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame(np.random.randint(10,100,25).reshape(5, 5),
                index=["a", "b", "c","d",'e'],
                columns=["V", "W", "X", "Y","Z"])
df

    V   W   X   Y   Z
a  51  31  68  84  82
b  75  43  83  18  74
c  69  46  61  58  38
d  28  44  28  43  11
e  39  54  52  63  42

In [5]:
df.iloc[:2]

    V   W   X   Y   Z
a  51  31  68  84  82
b  75  43  83  18  74

In [6]:
df.iloc[1,1]

43

In [8]:
df.loc['c','Y']

58

In [10]:
df.loc['b']

V    75
W    43
X    83
Y    18
Z    74
Name: b, dtype: int32

In [11]:
df.loc['c':'e']

    V   W   X   Y   Z
c  69  46  61  58  38
d  28  44  28  43  11
e  39  54  52  63  42

In [19]:
df.loc['c'].Z

38

In [22]:
df.loc[:'e'].V

a    51
b    75
c    69
d    28
e    39
Name: V, dtype: int32

In [23]:
df.loc['d','X':'Z'][1]

43

In [24]:
df['X']['a']

68

In [32]:
df.iloc[3,3]

43

In [33]:
df = pd.read_csv('data/법정동코드 전체자료.txt',sep='\t',encoding='euc-kr')
df.head()

        법정동코드           법정동명 폐지여부
0  1100000000          서울특별시   존재
1  1111000000      서울특별시 종로구   존재
2  1111010100  서울특별시 종로구 청운동   존재
3  1111010200  서울특별시 종로구 신교동   존재
4  1111010300  서울특별시 종로구 궁정동   존재

In [34]:
df.isna().sum().sum()

0

In [35]:
df = df[df.폐지여부 == '존재']
df.shape

(20551, 3)

In [39]:
df1 = df[df.법정동명.str.contains('경기도')]
df1.head()

           법정동코드             법정동명 폐지여부
4470  4100000000              경기도   존재
4819  4111000000          경기도 수원시   존재
4884  4111100000      경기도 수원시 장안구   존재
4913  4111112900  경기도 수원시 장안구 파장동   존재
4914  4111113000  경기도 수원시 장안구 정자동   존재

In [40]:
df2 = df1[df1.법정동명.str.contains('수원시')]
df2

           법정동코드             법정동명 폐지여부
4819  4111000000          경기도 수원시   존재
4884  4111100000      경기도 수원시 장안구   존재
4913  4111112900  경기도 수원시 장안구 파장동   존재
4914  4111113000  경기도 수원시 장안구 정자동   존재
4915  4111113100  경기도 수원시 장안구 이목동   존재
...          ...              ...  ...
5023  4111710300  경기도 수원시 영통구 이의동   존재
5024  4111710400   경기도 수원시 영통구 하동   존재
5025  4111710500  경기도 수원시 영통구 영통동   존재
5026  4111710600   경기도 수원시 영통구 신동   존재
5027  4111710700  경기도 수원시 영통구 망포동   존재

[61 rows x 3 columns]

In [41]:
df3 = df2[df2.법정동명.str.contains('장안구')]
df3

           법정동코드              법정동명 폐지여부
4884  4111100000       경기도 수원시 장안구   존재
4913  4111112900   경기도 수원시 장안구 파장동   존재
4914  4111113000   경기도 수원시 장안구 정자동   존재
4915  4111113100   경기도 수원시 장안구 이목동   존재
4916  4111113200   경기도 수원시 장안구 율전동   존재
4917  4111113300   경기도 수원시 장안구 천천동   존재
4918  4111113400   경기도 수원시 장안구 영화동   존재
4919  4111113500   경기도 수원시 장안구 송죽동   존재
4920  4111113600   경기도 수원시 장안구 조원동   존재
4921  4111113700   경기도 수원시 장안구 연무동   존재
4922  4111113800  경기도 수원시 장안구 상광교동   존재
4923  4111113900  경기도 수원시 장안구 하광교동   존재

In [32]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [33]:
titanic.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [34]:
titanic.drop(columns=['deck'],inplace=True)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,Queenstown,no,True

In [35]:
titanic.embarked.value_counts().max()

644

In [36]:
titanic.embarked.fillna('S',inplace=True)
titanic.embarked.value_counts()

embarked
S    646
C    168
Q     77
Name: count, dtype: int64

In [37]:
titanic.embark_town.value_counts().max()

644

In [38]:
titanic.embark_town.fillna('Southampton',inplace=True)
titanic.embark_town.value_counts()

embark_town
Southampton    646
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [39]:
titanic.age.fillna(titanic.age.median().round(0),inplace=True)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,Southampton,yes,True
888,0,3,female,28.0,1,2,23.45,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,Queenstown,no,True

In [40]:
titanic['age_group'] = pd.qcut(titanic.age,3,labels=['A1','A2','A3'])
titanic.age_group.isna().sum()

0

In [41]:
titanic.pivot_table('survived','sex','embarked').round(2)

embarked     C     Q     S
sex
female    0.88  0.75  0.69
male      0.31  0.07  0.17

In [42]:
titanic.pivot_table('age','sex',aggfunc='mean').round(2)

          age
sex
female  27.93
male    30.14